In [3]:
# Import libraries
import pandas as pd
import numpy as np

### Load Excel File

In [4]:
filename = 'data/car_financing.xlsx'
df = pd.read_excel(filename)

## Slicing
1. How to select columns in pandas 
2. How to use slicing operations in pandas

In [5]:
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

### Select columns using brackets
With square brackets, you can select one or more columns.

In [6]:
# Select one column using double brackets
df[['car_type']].head()

        car_type
0  Toyota Sienna
1  Toyota Sienna
2  Toyota Sienna
3  Toyota Sienna
4  Toyota Sienna

In [7]:
# Select multiple columns using double brackets
df[['car_type', 'Principal Paid']].head()

        car_type  Principal Paid
0  Toyota Sienna          484.30
1  Toyota Sienna          487.13
2  Toyota Sienna          489.98
3  Toyota Sienna          492.85
4  Toyota Sienna          495.73

In [8]:
# This is a Pandas DataFrame
type(df[['car_type']].head())

pandas.core.frame.DataFrame

In [9]:
# Select one column using single brackets
# This produces a pandas series which is a one-dimensional array which can be labeled
df['car_type'].head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

In [10]:
# This is a pandas series
type(df['car_type'].head())

pandas.core.series.Series

In [11]:
# Keep in mind that you can't select multiple colums using single brackets
# This will result in a KeyError
df['car_type', 'Principal Paid']

KeyError: ('car_type', 'Principal Paid')

In [ ]:
df[['car_type', 'Principal Paid']]

### Pandas Slicing

With a pandas series, we can select rows using slicing like this: series[start_index:end_index]

The end_index is not inclusive. This behavior is very similar to Python lists.

In [ ]:
df['car_type']

In [ ]:
df['car_type'][0:10]

In [ ]:
# Select column using dot notation. 
# This is not recommended.
df.car_type.head()

In [ ]:
"""
This won't work as there is a space in the column name. 
Dot notation also fails if your column has the same name 
of a DataFrame's attributes or methods.
"""
df.Principal Paid

In [ ]:
df['Principal Paid']

### Selecting Columns using loc
The pandas attribute .loc allow you to select columns, index, and slice your data.

In [ ]:
# pandas dataframe
df.loc[:, ['car_type']].head()

In [12]:
# pandas series
df.loc[:, 'car_type'].head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

In [22]:
# Return dataframe where the 'Starting Balance' is greater than 44,000.
df.loc[df['Starting Balance'] > 44000]

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
264,1,44409.6,1289.53,107.32,1182.21,43227.39,36,0.029,VW Golf R
300,1,44409.6,981.02,107.32,873.70,43535.90,48,0.029,VW Golf R
348,1,44409.6,796.01,107.32,688.69,43720.91,60,0.029,VW Golf R

In [24]:
# include only rows where the 'Starting Balance' is greater than 44,000 and then 
# selects just the 'Starting Balance' and 'Principal Paid' columns for those rows.

df.loc[df['Starting Balance'] > 44000, ['Starting Balance', 'Principal Paid']]

     Starting Balance  Principal Paid
264           44409.6         1182.21
300           44409.6          873.70
348           44409.6          688.69

In [21]:
# include only rows where 'Starting Balance' is greater than 44,000 and 'Principal Paid' is greater than 800.
df.loc[(df['Starting Balance'] > 44000) & (df['Principal Paid'] >800)]

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
264,1,44409.6,1289.53,107.32,1182.21,43227.39,36,0.029,VW Golf R
300,1,44409.6,981.02,107.32,873.70,43535.90,48,0.029,VW Golf R

In [25]:
# include rows where 'Starting Balance' is over 44,000 and 'Principal Paid' is over 800, 
# then selects only the 'Starting Balance', 'Principal Paid', and 'Interest Paid' columns for those rows.
df.loc[(df['Starting Balance'] > 44000) & (df['Principal Paid'] >800), ['Starting Balance', 'Principal Paid', 'Interest Paid']]

     Starting Balance  Principal Paid  Interest Paid
264           44409.6         1182.21         107.32
300           44409.6          873.70         107.32